<a href="https://colab.research.google.com/github/ashkanmulla/Ashkan_Data_Science_Practice/blob/main/Pandas_Practice.ipynb" target="_parent"><img src="https://colab.research.google.com/assets/colab-badge.svg" alt="Open In Colab"/></a>

In [168]:
#Series object in pandas

In [169]:
import pandas as pd

In [170]:
data = [1,2,3,4,]

In [171]:
series1 = pd.Series(data)

In [172]:
series1

0    1
1    2
2    3
3    4
dtype: int64

In [173]:
type(series1)

pandas.core.series.Series

In [174]:
#Changing the index of a series object

In [175]:
series1 = pd.Series(data, index = ["a", "b", "c,", "d"])
series1

a     1
b     2
c,    3
d     4
dtype: int64

In [176]:
#Creating a data frame using a list

In [177]:
import pandas as pd

In [178]:
data = [1,2,3,4]

In [179]:
df = pd.DataFrame(data)

In [180]:
df

   0
0  1
1  2
2  3
3  4

In [181]:
#Creating a dataframe using a dictionary

In [182]:
dictionary = {"Fruits" :["apple", "banana", "mangos"], "Count":[10,20,15]}

In [183]:
df = pd.DataFrame(dictionary)

In [184]:
df

   Fruits  Count
0   apple     10
1  banana     20
2  mangos     15

In [185]:
#Creating a dataframe using a series

In [186]:
series = pd.Series([6,12], index = ["a", "b"])
df = pd.DataFrame(series)

In [187]:
df

    0
a   6
b  12

In [188]:
#Creating a dataframe using a numpy array

In [189]:
import numpy as np

In [190]:
numpyarray = np.array([[50000,60000], ["Ashkan", "Mehjabeen"]])

In [191]:
df = pd.DataFrame({"name": numpyarray[1], "salary": numpyarray[0]})

In [192]:
df

        name salary
0     Ashkan  50000
1  Mehjabeen  60000

In [193]:
#How to perform a Merge Operation

In [194]:
import pandas as pd

In [195]:
player = ["Player1", "Player2", "Player3"]

In [196]:
point = [8,9,6]

In [197]:
title = ["Game1","Game2", "Game3"]

In [198]:
df1 = pd.DataFrame({"Player":player, "points":point, "Title":title})

In [199]:
df1

    Player  points  Title
0  Player1       8  Game1
1  Player2       9  Game2
2  Player3       6  Game3

In [200]:
player = ["Player1", "Player5", "Player6"]

In [201]:
power = ["Punch", "Kick", "Elbow"]

In [202]:
title = ["Game1", "Game5", "Game6"]

In [203]:
df2 = pd.DataFrame({"Player" :player, "Power" :power, "Title" :title})

In [204]:
df2

    Player  Power  Title
0  Player1  Punch  Game1
1  Player5   Kick  Game5
2  Player6  Elbow  Game6

In [205]:
#Inner Merge

In [206]:
df1.merge(df2, on = "Title")

  Player_x  points  Title Player_y  Power
0  Player1       8  Game1  Player1  Punch

In [207]:
#Left Merge

In [208]:
df1.merge(df2, on = "Player", how = "left")

    Player  points Title_x  Power Title_y
0  Player1       8   Game1  Punch   Game1
1  Player2       9   Game2    NaN     NaN
2  Player3       6   Game3    NaN     NaN

In [209]:
#Right Merge

In [210]:
df1.merge(df2, on = "Player", how = "right")

    Player  points Title_x  Power Title_y
0  Player1     8.0   Game1  Punch   Game1
1  Player5     NaN     NaN   Kick   Game5
2  Player6     NaN     NaN  Elbow   Game6

In [211]:
#Outer Merge

In [212]:
df1.merge(df2, on = "Player", how = "outer")

    Player  points Title_x  Power Title_y
0  Player1     8.0   Game1  Punch   Game1
1  Player2     9.0   Game2    NaN     NaN
2  Player3     6.0   Game3    NaN     NaN
3  Player5     NaN     NaN   Kick   Game5
4  Player6     NaN     NaN  Elbow   Game6

In [213]:
# How to perform join operation in pandas

In [214]:
player = ["Player1", "Player5", "Player6"]

In [215]:
power = ["Punch","Kick", "Elbow"]

In [216]:
title = ["Game1", "Game5", "Game6"]

In [217]:
df3 = pd.DataFrame({"Player" :player, "Power" :power, "Title" :title}, index = ["L1", "L2", "L3"])

In [218]:
df3

     Player  Power  Title
L1  Player1  Punch  Game1
L2  Player5   Kick  Game5
L3  Player6  Elbow  Game6

In [219]:
player = ["Player1", "Player5", "Player6"]

In [220]:
power = ["Punch","Kick", "Elbow"]

In [221]:
title = ["Game1", "Game5", "Game6"]

In [222]:
df4 = pd.DataFrame({"Players" :player, "Power" :power, "Titles" :title}, index = ["L2", "L3", "L4"])

In [223]:
df4

    Players  Power Titles
L2  Player1  Punch  Game1
L3  Player5   Kick  Game5
L4  Player6  Elbow  Game6

In [224]:
pd.concat([df3,df4])

     Player  Power  Title  Players Titles
L1  Player1  Punch  Game1      NaN    NaN
L2  Player5   Kick  Game5      NaN    NaN
L3  Player6  Elbow  Game6      NaN    NaN
L2      NaN  Punch    NaN  Player1  Game1
L3      NaN   Kick    NaN  Player5  Game5
L4      NaN  Elbow    NaN  Player6  Game6

In [225]:
#How to import dataset

In [226]:
import pandas as pd

In [227]:
cars = pd.read_csv("/content/mtcars.csv")

In [228]:
cars

     mpg  cyl   disp   hp  drat     wt   qsec  vs  am  gear  carb
0   21.0    6  160.0  110  3.90  2.620  16.46   0   1     4     4
1   21.0    6  160.0  110  3.90  2.875  17.02   0   1     4     4
2   22.8    4  108.0   93  3.85  2.320  18.61   1   1     4     1
3   21.4    6  258.0  110  3.08  3.215  19.44   1   0     3     1
4   18.7    8  360.0  175  3.15  3.440  17.02   0   0     3     2
5   18.1    6  225.0  105  2.76  3.460  20.22   1   0     3     1
6   14.3    8  360.0  245  3.21  3.570  15.84   0   0     3     4
7   24.4    4  146.7   62  3.69  3.190  20.00   1   0     4     2
8   22.8    4  140.8   95  3.92  3.150  22.90   1   0     4     2
9   19.2    6  167.6  123  3.92  3.440  18.30   1   0     4     4
10  17.8    6  167.6  123  3.92  3.440  18.90   1   0     4     4
11  16.4    8  275.8  180  3.07  4.070  17.40   0   0     3     3
12  17.3    8  275.8  180  3.07  3.730  17.60   0   0     3     3
13  15.2    8  275.8  180  3.07  3.780  18.00   0   0     3     3
14  10.4    8  472.0  205  2.93  5.250  17.98   0   0     3     4
15  10.4    8  460.0  215  3.00  5.424  17.82   0   0     3     4
16  14.7    8  440.0  230  3.23  5.345  17.42   0   0     3     4
17  32.4    4   78.7   66  4.08  2.200  19.47   1   1     4     1
18  30.4    4   75.7   52  4.93  1.615  18.52   1   1     4     2
19  33.9    4   71.1   65  4.22  1.835  19.90   1   1     4     1
20  21.5    4  120.1   97  3.70  2.465  20.01   1   0     3     1
21  15.5    8  318.0  150  2.76  3.520  16.87   0   0     3     2
22  15.2    8  304.0  150  3.15  3.435  17.30   0   0     3     2
23  13.3    8  350.0  245  3.73  3.840  15.41   0   0     3     4
24  19.2    8  400.0  175  3.08  3.845  17.05   0   0     3     2
25  27.3    4   79.0   66  4.08  1.935  18.90   1   1     4     1
26  26.0    4  120.3   91  4.43  2.140  16.70   0   1     5     2
27  30.4    4   95.1  113  3.77  1.513  16.90   1   1     5     2
28  15.8    8  351.0  264  4.22  3.170  14.50   0   1     5     4
29  19.7    6  145.0  175  3.62  2.770  15.50   0   1     5     6
30  15.0    8  301.0  335  3.54  3.570  14.60   0   1     5     8
31  21.4    4  121.0  109  4.11  2.780  18.60   1   1     4     2

In [167]:
#Importing & Analysing DataSets

In [229]:
type(cars)

pandas.core.frame.DataFrame

In [230]:
cars.head(10)

    mpg  cyl   disp   hp  drat     wt   qsec  vs  am  gear  carb
0  21.0    6  160.0  110  3.90  2.620  16.46   0   1     4     4
1  21.0    6  160.0  110  3.90  2.875  17.02   0   1     4     4
2  22.8    4  108.0   93  3.85  2.320  18.61   1   1     4     1
3  21.4    6  258.0  110  3.08  3.215  19.44   1   0     3     1
4  18.7    8  360.0  175  3.15  3.440  17.02   0   0     3     2
5  18.1    6  225.0  105  2.76  3.460  20.22   1   0     3     1
6  14.3    8  360.0  245  3.21  3.570  15.84   0   0     3     4
7  24.4    4  146.7   62  3.69  3.190  20.00   1   0     4     2
8  22.8    4  140.8   95  3.92  3.150  22.90   1   0     4     2
9  19.2    6  167.6  123  3.92  3.440  18.30   1   0     4     4

In [231]:
cars.tail(10)

     mpg  cyl   disp   hp  drat     wt   qsec  vs  am  gear  carb
22  15.2    8  304.0  150  3.15  3.435  17.30   0   0     3     2
23  13.3    8  350.0  245  3.73  3.840  15.41   0   0     3     4
24  19.2    8  400.0  175  3.08  3.845  17.05   0   0     3     2
25  27.3    4   79.0   66  4.08  1.935  18.90   1   1     4     1
26  26.0    4  120.3   91  4.43  2.140  16.70   0   1     5     2
27  30.4    4   95.1  113  3.77  1.513  16.90   1   1     5     2
28  15.8    8  351.0  264  4.22  3.170  14.50   0   1     5     4
29  19.7    6  145.0  175  3.62  2.770  15.50   0   1     5     6
30  15.0    8  301.0  335  3.54  3.570  14.60   0   1     5     8
31  21.4    4  121.0  109  4.11  2.780  18.60   1   1     4     2

In [232]:
cars.shape

(32, 11)

In [233]:
#Print a concise summary of the columns

In [234]:
cars.info(null_counts=True)

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 32 entries, 0 to 31
Data columns (total 11 columns):
 #   Column  Non-Null Count  Dtype
---  ------  --------------  -----
 0   mpg     32 non-null     float64
 1   cyl     32 non-null     int64
 2   disp    32 non-null     float64
 3   hp      32 non-null     int64
 4   drat    32 non-null     float64
 5   wt      32 non-null     float64
 6   qsec    32 non-null     float64
 7   vs      32 non-null     int64
 8   am      32 non-null     int64
 9   gear    32 non-null     int64
 10  carb    32 non-null     int64
dtypes: float64(5), int64(6)
memory usage: 2.9 KB

In [235]:
cars.info(null_counts=False)

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 32 entries, 0 to 31
Data columns (total 11 columns):
 #   Column  Dtype
---  ------  -----
 0   mpg     float64
 1   cyl     int64
 2   disp    float64
 3   hp      int64
 4   drat    float64
 5   wt      float64
 6   qsec    float64
 7   vs      int64
 8   am      int64
 9   gear    int64
 10  carb    int64
dtypes: float64(5), int64(6)
memory usage: 2.9 KB

In [236]:
cars.mean()

mpg      20.090625
cyl       6.187500
disp    230.721875
hp      146.687500
drat      3.596563
wt        3.217250
qsec     17.848750
vs        0.437500
am        0.406250
gear      3.687500
carb      2.812500
dtype: float64

In [237]:
cars.median()

mpg      19.200
cyl       6.000
disp    196.300
hp      123.000
drat      3.695
wt        3.325
qsec     17.710
vs        0.000
am        0.000
gear      4.000
carb      2.000
dtype: float64

In [238]:
cars.mode()

    mpg  cyl   disp     hp  drat    wt   qsec   vs   am  gear  carb
0  10.4  8.0  275.8  110.0  3.07  3.44  17.02  0.0  0.0   3.0   2.0
1  15.2  NaN    NaN  175.0  3.92   NaN  18.90  NaN  NaN   NaN   4.0
2  19.2  NaN    NaN  180.0   NaN   NaN    NaN  NaN  NaN   NaN   NaN
3  21.0  NaN    NaN    NaN   NaN   NaN    NaN  NaN  NaN   NaN   NaN
4  21.4  NaN    NaN    NaN   NaN   NaN    NaN  NaN  NaN   NaN   NaN
5  22.8  NaN    NaN    NaN   NaN   NaN    NaN  NaN  NaN   NaN   NaN
6  30.4  NaN    NaN    NaN   NaN   NaN    NaN  NaN  NaN   NaN   NaN

In [239]:
cars.std()

mpg       6.026948
cyl       1.785922
disp    123.938694
hp       68.562868
drat      0.534679
wt        0.978457
qsec      1.786943
vs        0.504016
am        0.498991
gear      0.737804
carb      1.615200
dtype: float64

In [240]:
cars.max()

mpg      33.900
cyl       8.000
disp    472.000
hp      335.000
drat      4.930
wt        5.424
qsec     22.900
vs        1.000
am        1.000
gear      5.000
carb      8.000
dtype: float64

In [241]:
cars.min()

mpg     10.400
cyl      4.000
disp    71.100
hp      52.000
drat     2.760
wt       1.513
qsec    14.500
vs       0.000
am       0.000
gear     3.000
carb     1.000
dtype: float64

In [242]:
cars.count()

mpg     32
cyl     32
disp    32
hp      32
drat    32
wt      32
qsec    32
vs      32
am      32
gear    32
carb    32
dtype: int64

In [243]:
cars.describe()

             mpg        cyl        disp  ...         am       gear     carb
count  32.000000  32.000000   32.000000  ...  32.000000  32.000000  32.0000
mean   20.090625   6.187500  230.721875  ...   0.406250   3.687500   2.8125
std     6.026948   1.785922  123.938694  ...   0.498991   0.737804   1.6152
min    10.400000   4.000000   71.100000  ...   0.000000   3.000000   1.0000
25%    15.425000   4.000000  120.825000  ...   0.000000   3.000000   2.0000
50%    19.200000   6.000000  196.300000  ...   0.000000   4.000000   2.0000
75%    22.800000   8.000000  326.000000  ...   1.000000   4.000000   4.0000
max    33.900000   8.000000  472.000000  ...   1.000000   5.000000   8.0000

[8 rows x 11 columns]

In [244]:
#View specific column only (indexing by position)

In [246]:
cars.iloc[:,4]

0     3.90
1     3.90
2     3.85
3     3.08
4     3.15
5     2.76
6     3.21
7     3.69
8     3.92
9     3.92
10    3.92
11    3.07
12    3.07
13    3.07
14    2.93
15    3.00
16    3.23
17    4.08
18    4.93
19    4.22
20    3.70
21    2.76
22    3.15
23    3.73
24    3.08
25    4.08
26    4.43
27    3.77
28    4.22
29    3.62
30    3.54
31    4.11
Name: drat, dtype: float64

In [247]:
cars.iloc[0:5:4]

    mpg  cyl   disp   hp  drat    wt   qsec  vs  am  gear  carb
0  21.0    6  160.0  110  3.90  2.62  16.46   0   1     4     4
4  18.7    8  360.0  175  3.15  3.44  17.02   0   0     3     2

In [249]:
cars.loc[:,"mpg"]

0     21.0
1     21.0
2     22.8
3     21.4
4     18.7
5     18.1
6     14.3
7     24.4
8     22.8
9     19.2
10    17.8
11    16.4
12    17.3
13    15.2
14    10.4
15    10.4
16    14.7
17    32.4
18    30.4
19    33.9
20    21.5
21    15.5
22    15.2
23    13.3
24    19.2
25    27.3
26    26.0
27    30.4
28    15.8
29    19.7
30    15.0
31    21.4
Name: mpg, dtype: float64

In [250]:
cars.sort_values(by = "cyl")

     mpg  cyl   disp   hp  drat     wt   qsec  vs  am  gear  carb
31  21.4    4  121.0  109  4.11  2.780  18.60   1   1     4     2
2   22.8    4  108.0   93  3.85  2.320  18.61   1   1     4     1
27  30.4    4   95.1  113  3.77  1.513  16.90   1   1     5     2
26  26.0    4  120.3   91  4.43  2.140  16.70   0   1     5     2
25  27.3    4   79.0   66  4.08  1.935  18.90   1   1     4     1
20  21.5    4  120.1   97  3.70  2.465  20.01   1   0     3     1
7   24.4    4  146.7   62  3.69  3.190  20.00   1   0     4     2
8   22.8    4  140.8   95  3.92  3.150  22.90   1   0     4     2
19  33.9    4   71.1   65  4.22  1.835  19.90   1   1     4     1
18  30.4    4   75.7   52  4.93  1.615  18.52   1   1     4     2
17  32.4    4   78.7   66  4.08  2.200  19.47   1   1     4     1
29  19.7    6  145.0  175  3.62  2.770  15.50   0   1     5     6
0   21.0    6  160.0  110  3.90  2.620  16.46   0   1     4     4
1   21.0    6  160.0  110  3.90  2.875  17.02   0   1     4     4
3   21.4    6  258.0  110  3.08  3.215  19.44   1   0     3     1
10  17.8    6  167.6  123  3.92  3.440  18.90   1   0     4     4
9   19.2    6  167.6  123  3.92  3.440  18.30   1   0     4     4
5   18.1    6  225.0  105  2.76  3.460  20.22   1   0     3     1
13  15.2    8  275.8  180  3.07  3.780  18.00   0   0     3     3
28  15.8    8  351.0  264  4.22  3.170  14.50   0   1     5     4
4   18.7    8  360.0  175  3.15  3.440  17.02   0   0     3     2
24  19.2    8  400.0  175  3.08  3.845  17.05   0   0     3     2
23  13.3    8  350.0  245  3.73  3.840  15.41   0   0     3     4
22  15.2    8  304.0  150  3.15  3.435  17.30   0   0     3     2
21  15.5    8  318.0  150  2.76  3.520  16.87   0   0     3     2
6   14.3    8  360.0  245  3.21  3.570  15.84   0   0     3     4
11  16.4    8  275.8  180  3.07  4.070  17.40   0   0     3     3
16  14.7    8  440.0  230  3.23  5.345  17.42   0   0     3     4
30  15.0    8  301.0  335  3.54  3.570  14.60   0   1     5     8
14  10.4    8  472.0  205  2.93  5.250  17.98   0   0     3     4
12  17.3    8  275.8  180  3.07  3.730  17.60   0   0     3     3
15  10.4    8  460.0  215  3.00  5.424  17.82   0   0     3     4

In [251]:
cars.sort_values(by = "cyl", ascending=False)

     mpg  cyl   disp   hp  drat     wt   qsec  vs  am  gear  carb
16  14.7    8  440.0  230  3.23  5.345  17.42   0   0     3     4
30  15.0    8  301.0  335  3.54  3.570  14.60   0   1     5     8
4   18.7    8  360.0  175  3.15  3.440  17.02   0   0     3     2
28  15.8    8  351.0  264  4.22  3.170  14.50   0   1     5     4
6   14.3    8  360.0  245  3.21  3.570  15.84   0   0     3     4
24  19.2    8  400.0  175  3.08  3.845  17.05   0   0     3     2
23  13.3    8  350.0  245  3.73  3.840  15.41   0   0     3     4
22  15.2    8  304.0  150  3.15  3.435  17.30   0   0     3     2
21  15.5    8  318.0  150  2.76  3.520  16.87   0   0     3     2
11  16.4    8  275.8  180  3.07  4.070  17.40   0   0     3     3
12  17.3    8  275.8  180  3.07  3.730  17.60   0   0     3     3
13  15.2    8  275.8  180  3.07  3.780  18.00   0   0     3     3
14  10.4    8  472.0  205  2.93  5.250  17.98   0   0     3     4
15  10.4    8  460.0  215  3.00  5.424  17.82   0   0     3     4
1   21.0    6  160.0  110  3.90  2.875  17.02   0   1     4     4
29  19.7    6  145.0  175  3.62  2.770  15.50   0   1     5     6
0   21.0    6  160.0  110  3.90  2.620  16.46   0   1     4     4
10  17.8    6  167.6  123  3.92  3.440  18.90   1   0     4     4
9   19.2    6  167.6  123  3.92  3.440  18.30   1   0     4     4
5   18.1    6  225.0  105  2.76  3.460  20.22   1   0     3     1
3   21.4    6  258.0  110  3.08  3.215  19.44   1   0     3     1
17  32.4    4   78.7   66  4.08  2.200  19.47   1   1     4     1
18  30.4    4   75.7   52  4.93  1.615  18.52   1   1     4     2
19  33.9    4   71.1   65  4.22  1.835  19.90   1   1     4     1
20  21.5    4  120.1   97  3.70  2.465  20.01   1   0     3     1
8   22.8    4  140.8   95  3.92  3.150  22.90   1   0     4     2
7   24.4    4  146.7   62  3.69  3.190  20.00   1   0     4     2
25  27.3    4   79.0   66  4.08  1.935  18.90   1   1     4     1
26  26.0    4  120.3   91  4.43  2.140  16.70   0   1     5     2
27  30.4    4   95.1  113  3.77  1.513  16.90   1   1     5     2
2   22.8    4  108.0   93  3.85  2.320  18.61   1   1     4     1
31  21.4    4  121.0  109  4.11  2.780  18.60   1   1     4     2

In [262]:
#Filter Records with more than 6 cyl and hp more than 300

In [255]:
filter1 = cars["cyl"]>6

In [256]:
# Filter Record with more then 6 cylinder

In [257]:
filtered_new = cars[filter1]

In [258]:
filtered_new

     mpg  cyl   disp   hp  drat     wt   qsec  vs  am  gear  carb
4   18.7    8  360.0  175  3.15  3.440  17.02   0   0     3     2
6   14.3    8  360.0  245  3.21  3.570  15.84   0   0     3     4
11  16.4    8  275.8  180  3.07  4.070  17.40   0   0     3     3
12  17.3    8  275.8  180  3.07  3.730  17.60   0   0     3     3
13  15.2    8  275.8  180  3.07  3.780  18.00   0   0     3     3
14  10.4    8  472.0  205  2.93  5.250  17.98   0   0     3     4
15  10.4    8  460.0  215  3.00  5.424  17.82   0   0     3     4
16  14.7    8  440.0  230  3.23  5.345  17.42   0   0     3     4
21  15.5    8  318.0  150  2.76  3.520  16.87   0   0     3     2
22  15.2    8  304.0  150  3.15  3.435  17.30   0   0     3     2
23  13.3    8  350.0  245  3.73  3.840  15.41   0   0     3     4
24  19.2    8  400.0  175  3.08  3.845  17.05   0   0     3     2
28  15.8    8  351.0  264  4.22  3.170  14.50   0   1     5     4
30  15.0    8  301.0  335  3.54  3.570  14.60   0   1     5     8

In [259]:
filter2 = (cars["cyl"]>6) & (cars["hp"] > 300)

In [260]:
filtered_review = cars[filter2]

In [261]:
filtered_review

     mpg  cyl   disp   hp  drat    wt  qsec  vs  am  gear  carb
30  15.0    8  301.0  335  3.54  3.57  14.6   0   1     5     8